import { Page } from '../components/Page';

export default () => (
  <Page title="Данакт">
    <h1>Данакт</h1>

    <p>
      <strong>Дана́кт</strong> — мужское русское личное имя греческого происхождения, восходит к др.-греч. Δάναξ
      (родительный падеж Δάνακτα).
    </p>

    <p>
      В православном именослове имя <em>Данакт</em> соотносится с двумя святыми мучениками: прежде всего — с Данактом
      Иллирийским, <em>(II век, чтец церкви из Авлона, Иллирия — ныне Албания, убит греческими язычниками)</em>, а также
      с Данактом Калашниковым{' '}
      <em>
        (1882—1937 годы, пос. Бутово, иеромонах, расстрелян НКВД за контрреволюционную агитацию, реабилитирован в 1989
        году)
      </em>
      .
    </p>

    <p>Практически не употребляется в настоящее время. Этимология имени неизвестна.</p>
  </Page>
);
