import { Page } from '../components/Page';

export default () => (
  <Page title="Данакт FAQ">
    <h1>Данакт FAQ</h1>

    <h2>А как тебя на самом деле зовут?</h2>
    <p>
      <em>Дана́кт</em> — моё настоящее имя, данное мне при рождении.
    </p>

    <h2>Ты не русский?</h2>
    <p>Я русский.</p>

    <h2>А имя чьё?</h2>
    <p>
      <em>Данакт</em> это мужское русское личное имя греческого происхождения, восходит к др.-греч. Δάναξ (родительный
      падеж Δάνακτος). Было взято моими родителями из православного именослова.
    </p>

    <h2>А что оно обозначает?</h2>
    <p>Ничего.</p>

    <h2>Никогда не слышал(а).</h2>
    <p>Я тоже.</p>

    <p>
      В именослов имя <em>Данакт</em> попало благодаря христианскому мученику Данакту (Данаксу) Иллирийскому (II век) —
      чтецу церкви из Авлона в Иллирии (ныне Влёра, Албания), который был убит язычниками за отказ принести жертву
      Дионису.
    </p>

    <p>Практически не употребляется в настоящее время.</p>

    <h2>А друзья тебя как называют?</h2>

    <p>
      В основном <em>Данакт</em>. Некоторые близкие друзья называют <em>Дан</em>. Бабушка — <em>Данюша</em>.
    </p>
  </Page>
);
